Repository: Jelka-FMF/Jelkob
Catalog: runner/locale/*/LC_MESSAGES/django.po
Languages: sl

source: Runner Information
sl: Podatki o izvajanju

source: Author Information
sl: Podatki o avtorju

source: Pattern Status
sl: Stanje vzorca

source: Enable selected patterns
sl: Omogoči izbrane vzorce

source: Disable selected patterns
sl: Onemogoči izbrane vzorce

source: Show selected patterns
sl: Pokaži izbrane vzorce

source: Hide selected patterns
sl: Skrij izbrane vzorce

source: Delete selected patterns
sl: Izbriši izbrane vzorce

source: Runner Status
sl: Stanje zaganjalnika

source: current pattern remaining
sl: preostali čas

source: runner is active
sl: trenutno aktiven

source: Runner
sl: Zaganjalnik

source: identifier
sl: identifikator

source: name
sl: ime

source: description
sl: opis

source: source
sl: vir

source: duration
sl: trajanje

source: author
sl: avtor

source: school
sl: šola

source: enabled
sl: omogočen

source: visible
sl: viden

source: pattern
sl: vzorec

source: patterns
sl: vzorci

source: current pattern
sl: trenutni vzorec

source: current pattern started
sl: začetni čas

source: runner last active
sl: nazadnje aktiven

source: state
sl: stanje

source: State
sl: Stanje

source: default duration
sl: privzeto trajanje

source: config
sl: nastavitve

source: Config
sl: Nastavitve
