Repository: Jelka-FMF/Jelkob
Catalog: frontend/locale/*/LC_MESSAGES/django.po
Languages: sl

source: About
sl: Informacije

source: Basic information about the Jelka FMF project
sl: Osnovne informacije o projektu Jelka FMF

source: About Jelka FMF
sl: O Jelki FMF

source: At the <a href="https://www.fmf.uni-lj.si/" target="_blank">Faculty of Mathematics and Physics, University of Ljubljana</a>, as part of the <a href="https://programerski-klub-fmf.github.io/" target="_blank">FMF Programming Club</a>, we set up a programmable Christmas tree. The project was made possible with the sponsorship of <a href="https://abelium.si/" target="_blank">Abelium</a> and <a href="https://acex.si/" target="_blank">Acex</a>.
sl: Na <a href="https://www.fmf.uni-lj.si/" target="_blank">Fakulteti za matematiko in fiziko Univerze v Ljubljani</a> smo v okviru <a href="https://programerski-klub-fmf.github.io/" target="_blank">Programerskega kluba FMF</a> postavili jelko z lučkami, ki jih lahko programiramo. Projekt poteka pod sponzorstvom podjetij <a href="https://abelium.si/" target="_blank">Abelium</a> in <a href="https://acex.si/" target="_blank">Acex</a>.

source: The tree is located at the entrance of the building at <a href="https://www.google.si/maps/place/Jadranska+ulica+21,+1000+Ljubljana" target="_blank">Jadranska 21</a> and is lit from morning until the building closes.
sl: Jelka stoji pri vhodu v stavbo na <a href="https://www.google.si/maps/place/Jadranska+ulica+21,+1000+Ljubljana" target="_blank">Jadranski 21</a> in je prižgana od jutra do zaprtja stavbe.

source: You can check the project's source code on <a href="https://github.com/Jelka-FMF" target="_blank">GitHub</a>.
sl: Izvorno kodo projekta si lahko ogledate na <a href="https://github.com/Jelka-FMF" target="_blank">GitHubu</a>.

source: How it Works
sl: Kako deluje

source: Our tree consists of multiple components that work together to create a programmable Christmas tree. The tree itself is controlled by a Raspberry Pi, which continuously communicates with the main server to get the list of patterns to run. This program is called <a href="https://github.com/Jelka-FMF/Korenine" target="_blank">Korenine</a>. It cycles through the available patterns and runs them one by one in a Docker container. The patterns are containerized in the Docker container and can be written in any programming language that can write to the standard output. The program reads the output of the pattern and controls the lights on the tree accordingly using a library. The current state of the tree is also sent back to the server, where it is displayed on the simulation on the website.
sl: Jelka je sestavljena iz več komponent, ki skupaj sestavljajo programabilno novoletno jelko. Jelko fizično upravlja Raspberry Pi, ki redno komunicira z glavnim strežnikom, da dobi seznam vzorcev, ki jih mora zagnati. Ta program se imenuje <a href="https://github.com/Jelka-FMF/Korenine" target="_blank">Korenine</a>. Korenine ciklično menjavajo vzorce ter jih zaporedno zaganjajo v Docker containerju. Vzorci so zapakirani v Docker container in jih je mogoče napisati v kateremkoli programskem jeziku, ki zna pisati na standardni izhod. Program bere izhod vzorca ter glede nanj upravlja lučke na jelki s pomočjo knjižnice. Trenutno stanje jelke poleg tega pošilja nazaj na strežnik, kjer se prikazuje na simulaciji na spletni strani.

source: The main server, called <a href="https://github.com/Jelka-FMF/Jelkob" target="_blank">Jelkob</a>, hosts the project website, the pattern database, and the Docker registry. The website is written in Django and uses the Django REST framework for the API. Using the website, we can control which patterns are running on the tree and manually run them. The website also shows a list of available patterns, the current state of the tree, and the live simulation.
sl: Glavni strežnik, imenovan <a href="https://github.com/Jelka-FMF/Jelkob" target="_blank">Jelkob</a>, gosti spletno stran projekta, bazo vzorcev in Docker register. Spletna stran je napisana v Djangu in uporablja ogrodje Django REST Framework za API. S spletno stranjo lahko upravljamo, kateri vzorci se zaganjajo na jelki in jih po potrebi ročno zaganjamo. Spletna stran prikazuje tudi seznam razpoložljivih vzorcev, trenutno stanje jelke in simulacijo.

source: The patterns themselves are written in various programming languages and are stored in the <a href="https://github.com/Jelka-FMF/Storzi" target="_blank">Storži</a> repository. Each pattern is packaged in a Docker container. The patterns can be written in any programming language that can write to the standard output, but we provide user-friendly libraries for popular languages like Python and JavaScript. Patterns can read 3D positions of the lights on the tree and control them accordingly by sending the desired colors to the standard output.
sl: Vzorci so napisani v različnih programskih jezikih in so shranjeni v repozitoriju <a href="https://github.com/Jelka-FMF/Storzi" target="_blank">Storži</a>. Vsak vzorec je zapakiran v Docker container. Vzorci so lahko napisani v kateremkoli programskem jeziku, ki zna pisati na standardni izhod, vendar za popularne jezike, kot sta Python in JavaScript, ponujamo uporabniku prijazne knjižnice. Vzorci lahko preberejo 3D pozicije lučk na jelki in jih upravljajo tako, da želene barve lučk pošiljajo na standardni izhod.

source: To get the 3D positions of the lights on the tree, we recorded multiple videos of the tree from multiple angles while running a calibration pattern. We then extracted a 2D position for each light for each angle. Based on these 2D positions, we then calculated the 3D positions of the lights on the tree. This was done using our program called <a href="https://github.com/Jelka-FMF/Jelkulator" target="_blank">Jelkulator</a>.
sl: Da smo dobili 3D pozicije lučk na jelki, smo posneli več videov jelke iz različnih kotov, medtem ko je bil prižgan kalibracijski vzorec. Iz teh videov smo nato izluščili 2D pozicijo vsake lučke za vsak kot. Na podlagi teh 2D pozicij smo nato izračunali 3D pozicije lučk na jelki. To smo naredili s programom, ki smo ga poimenovali <a href="https://github.com/Jelka-FMF/Jelkulator" target="_blank">Jelkulator</a>.

source: Another big part of the project is <a href="https://github.com/Jelka-FMF/Jelkly" target="_blank">Jelkly</a>, a Scratch-like visual programming tool that allows users to create their own patterns without any programming knowledge. Jelkly is written in TypeScript using the Microsoft's MakeCode (PXT) framework, which uses the Blockly library. It provides the 2D and 3D simulation of the tree which enable users to see how their pattern would look on the real tree. Patterns created in Jelkly can be directly submitted to the server, where we review them, convert them to JavaScript, and add them to the Storži repository, where they can run on the tree.
sl: Še en pomemben del projekta je <a href="https://github.com/Jelka-FMF/Jelkly" target="_blank">Jelkly</a>, Scratchu-podobno orodje za vizualno programiranje, ki uporabnikom omogoča ustvarjanje lastnih vzorcev brez znanja programiranja. Jelkly je napisan v TypeScriptu z uporabo Microsoftovega orodja MakeCode (PXT), ki uporablja knjižnico Blockly (od tod tudi ime Jelkly). Na Jelklyju je tudi simulacija, s katero si lahko uporabniki lažje predstavljajo, kako bo njihov vzorec izgledal na pravi jelki. Uporabniki lahko vzorce, ustvarjene v Jelklyju, neposredno pošljejo na strežnik, kjer jih pregledamo, pretvorimo v JavaScript in dodamo v repozitorij Storži, kjer se lahko izvajajo na jelki.

source: Contributing Patterns
sl: Prispevanje vzorcev

source: If you would like to contribute your own pattern for running on Jelka FMF and already have programming knowledge, please check out the <a href="https://github.com/Jelka-FMF/Storzi" target="_blank">Storži</a> repository that contains already-existing patterns and instructions for submitting your own patterns in various programming languages.
sl: Če želite prispevati svoj vzorec za Jelko FMF in že imate znanje programiranja, si oglejte repozitorij <a href="https://github.com/Jelka-FMF/Storzi" target="_blank">Storži</a>, ki vsebuje že obstoječe vzorce in navodila za oddajo lastnih vzorcev v različnih programskih jezikih.

source: If you would like to submit a pattern but do not have programming knowledge yet, you can check out <a href="https://jelkly.fmf.uni-lj.si/docs" target="_blank">Jelkly</a>, a Scratch-like visual programming tool for creating and submitting your own Jelka FMF patterns. It is easy to use even for beginners and people without programming knowledge, as it allows you to easily build programs using visual blocks.
sl: Če želite oddati vzorec, ampak še nimate znanja programiranja, si oglejte <a href="https://jelkly.fmf.uni-lj.si/docs" target="_blank">Jelkly</a>, Scratchu podobno orodje za vizualno programiranje, s katerim lahko enostavno ustvarite in oddate svoje vzorce za Jelko FMF. Uporaba je preprosta tudi za začetnike in ljudi brez znanja programiranja, saj omogoča enostavno sestavljanje programov z uporabo vizualnih blokov.

source: Photo of the Jelka FMF Christmas tree
sl: Fotografija novoletne jelke Jelka FMF

source: Previous
sl: Nazaj

source: Next
sl: Naprej

source: Christmas tree at the Faculty of Mathematics and Physics, University of Ljubljana
sl: Novoletna jelka na Fakulteti za matematiko in fiziko Univerze v Ljubljani

source: Toggle navigation
sl: Preklopi navigacijo

source: Patterns
sl: Vzorci

source: Contact
sl: Kontakt

source: Management
sl: Upravljanje

source: Log Out
sl: Odjava

source: Log In
sl: Prijava

source: Language
sl: Jezik

source: Contact information for the Jelka FMF project
sl: Kontaktne informacije za projekt Jelka FMF

source: If you are a student and have questions about the project or would like to contact people involved in the project, you can join the <a href="https://discord.gg/ccg4nKVR44" target="_blank">FMF Programming Club Discord server</a> and ask your questions in the <code>#jelka</code> channel.
sl: Če ste dijak ali študent in imate vprašanja o projektu ali bi se radi povezali z ljudmi, ki so vključeni v projekt, se lahko pridružite <a href="https://discord.gg/ccg4nKVR44" target="_blank">Discord strežniku Programerskega kluba FMF</a> in svoja vprašanja zastavite v kanalu <code>#jelka</code>.

source: If you do not have a Discord account, or are a teacher at a school that is participating or would like to participate in the project, you can contact the project's coordinator, <a href="https://www.fmf.uni-lj.si/en/directory/742/bercic-katja/" target="_blank">Assist. Dr. Katja Berčič</a>.
sl: Če nimate Discord računa ali ste učitelj na šoli, ki sodeluje ali bi rada sodelovala v projektu, se lahko obrnete na koordinatorico projekta, <a href="https://www.fmf.uni-lj.si/sl/imenik/742/bercic-katja/" target="_blank">asist. dr. Katjo Berčič</a>.

source: Developers
sl: Razvijalci

source: People who worked on the project:
sl: Glavni razvijalci projekta:

source: ... and other members of the FMF Programming Club.
sl: ... in ostali člani Programerskega kluba FMF.

source: Some members of the FMF Programming Club
sl: Nekaj članov Programerskega kluba FMF

source: Login
sl: Prijava

source: Login page for the Jelka FMF project
sl: Prijavna stran za projekt Jelka FMF

source: Your username and password didn't match. Please try again.
sl: Vaše uporabniško ime in geslo se ne ujemata. Poskusite znova.

source: Your account doesn't have access to this page. To proceed, please log in with an account that has access.
sl: Vaš račun nima dostopa do te strani. Za nadaljevanje se prijavite z računom, ki ima dostop.

source: Please log in to see this page.
sl: Za ogled te strani se prijavite.

source: Logout
sl: Odjava

source: Logout page for the Jelka FMF project
sl: Odjavna stran za projekt Jelka FMF

source: You have been logged out successfully.
sl: Uspešno ste se odjavili.

source: Displaying the patterns requires JavaScript to be enabled. Please enable it.
sl: Za prikaz vzorcev je potreben JavaScript. Prosimo, omogočite ga.

source: Time
sl: Čas

source: Name
sl: Ime

source: Author
sl: Avtor

source: Actions
sl: Dejanja

source: The Christmas tree is currently sleeping. Visit us when it is active.
sl: Jelka trenutno spi. Obiščite nas, ko je aktivna.

source: The Christmas tree is running. Visit us and view it at the Faculty of Mathematics and Physics, University of Ljubljana.
sl: Jelka je prižgana. Obiščite nas in si jo oglejte na Fakulteti za matematiko in fiziko Univerze v Ljubljani.

source: Read more about the tree or contribute your own patterns on <a href="%(about_url)s">the about page</a>.
sl: Preberite več o jelki ali prispevajte svoje vzorce na <a href="%(about_url)s">strani z informacijami</a>.

source: Run
sl: Zaženi

source: Enable
sl: Omogoči

source: Disable
sl: Onemogoči

source: Christmas Lights Banner
sl: Naslovna slika novoletnih lučk

source: Christmas Baubles Banner
sl: Naslovna slika novoletnih kroglic
